app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "created_at", "updated_at", "user_id") VALUES ('2025-10-24 02:03:00', 2, 'se', 'sef', 3, 'sefsef', '2025-10-22 17:57:05.658793', '2025-10-22 17:57:05.658793', 46) RETURNING "id"

  def destroy
    @event.destroy!
---
DELETE FROM "events" WHERE "events"."id" = 181

    def set_event
      @event = Event.find(params.expect(:id))
---
SELECT "events".* FROM "events" WHERE "events"."id" = 181 LIMIT 1